exacttarget/exacttarget-connector/exacttarget-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/exacttarget/api_insertDataToDataExtension_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://exacttarget.com/wsdl/partnerAPI"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <fueloauth xmlns="http://exacttarget.com">%s(accessToken)</fueloauth>
   </soapenv:Header>
   <soapenv:Body>
      <CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
         <Options />
         <Objects xsi:type="DataExtensionObject" xmlns:ns1="http://exacttarget.com/wsdl/partnerAPI">
            <CustomerKey>%s(dataExtCustomerKey)</CustomerKey>
            <Properties>
               <Property>
                  <Name>INVALID</Name>
                  <Value>testfield3</Value>
               </Property>
               <Property>
                  <Name>%s(dataExtField2)</Name>
                  <Value>testfield4</Value>
               </Property>
            </Properties>
         </Objects>
      </CreateRequest>
   </soapenv:Body>
</soapenv:Envelope>